#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-address-checker]
azurerm_application_insights.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-address-checker/providers/Microsoft.Insights/components/appi-nbn-address-checker]
azurerm_service_plan.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-address-checker/providers/Microsoft.Web/serverfarms/plan-nbn-address-checker]
azurerm_storage_account.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-address-checker/providers/Microsoft.Storage/storageAccounts/stfuncnbnaddresschecker]
azurerm_storage_container.app: Refreshing state... [id=https://stfuncnbnaddresschecker.blob.core.windows.net/content]
azurerm_storage_blob.app: Refreshing state... [id=https://stfuncnbnaddresschecker.blob.core.windows.net/content/fc6ddb5e89fd47088e0855e248e2596a1dd19134a0f9e168c08155070c0b4f94.zip]
azurerm_linux_function_app.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-address-checker/providers/Microsoft.Web/sites/func-nbn-address-checker]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_linux_function_app.app has changed
  ~ resource "azurerm_linux_function_app" "app" {
        id                                = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-address-checker/providers/Microsoft.Web/sites/func-nbn-address-checker"
        name                              = "func-nbn-address-checker"
      ~ tags                              = {
          + "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=1df95c6a-e488-4233-82a2-d0fc3041b9f2;IngestionEndpoint=https://australiaeast-0.in.applicationinsights.azure.com/;LiveEndpoint=https://australiaeast.livediagnostics.monitor.azure.com/"
          + "hidden-link: /app-insights-instrumentation-key" = "1df95c6a-e488-4233-82a2-d0fc3041b9f2"
          + "hidden-link: /app-insights-resource-id"         = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-address-checker/providers/microsoft.insights/components/appi-nbn-address-checker"
        }
        # (25 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_storage_account_blob_container_sas.app will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "app"  {
      ~ connection_string = (sensitive value)
      - https_only        = true -> null
      ~ id                = "55b53597097f264d60cd97ff7885f0a5521610d26c394146dc1c91d13f59630d" -> (known after apply)
      ~ sas               = (sensitive value)
        # (3 unchanged attributes hidden)


      + timeouts {
          + read = (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # azurerm_application_insights.app must be replaced
-/+ resource "azurerm_application_insights" "app" {
      ~ app_id                                = "4a307dce-733f-4727-a63e-90f9b1511fa6" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-address-checker/providers/Microsoft.Insights/components/appi-nbn-address-checker" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "appi-nbn-address-checker" -> "appi-nbn-location-checker" # forces replacement
      ~ resource_group_name                   = "rg-nbn-address-checker" -> "rg-nbn-location-checker" # forces replacement
      - tags                                  = {} -> null
        # (9 unchanged attributes hidden)
    }

  # azurerm_linux_function_app.app must be replaced
-/+ resource "azurerm_linux_function_app" "app" {
      ~ app_settings                      = {
          - "AzureWebJobsSendGridApiKey" = (sensitive)
          - "FUNCTIONS_WORKER_RUNTIME"   = "python"
          - "WEBSITE_RUN_FROM_PACKAGE"   = (sensitive)
        } -> (known after apply)
      ~ custom_domain_verification_id     = (sensitive value)
      ~ default_hostname                  = "" -> (known after apply)
      ~ id                                = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-address-checker/providers/Microsoft.Web/sites/func-nbn-address-checker" -> (known after apply)
      ~ key_vault_reference_identity_id   = "SystemAssigned" -> (known after apply)
      ~ kind                              = "functionapp,linux" -> (known after apply)
      ~ name                              = "func-nbn-address-checker" -> "func-nbn-location-checker" # forces replacement
      ~ outbound_ip_address_list          = [] -> (known after apply)
      ~ outbound_ip_addresses             = "" -> (known after apply)
      ~ possible_outbound_ip_address_list = [] -> (known after apply)
      ~ possible_outbound_ip_addresses    = "" -> (known after apply)
      ~ resource_group_name               = "rg-nbn-address-checker" -> "rg-nbn-location-checker" # forces replacement
      ~ service_plan_id                   = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-address-checker/providers/Microsoft.Web/serverfarms/plan-nbn-address-checker" -> (known after apply)
      ~ site_credential                   = [
          - {
              - name     = "$func-nbn-address-checker"
              - password = "8kd8cv1j1R1yhx2r7mYJvMFHaa8WyMgtvm3RergWXfQnRm1WccxK28ya27Gx"
            },
        ] -> (known after apply)
      ~ storage_account_access_key        = (sensitive value)
      ~ storage_account_name              = "stfuncnbnaddresschecker" -> "stfuncnbnlocationchecker"
      - storage_key_vault_secret_id       = "" -> null
      - tags                              = {
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=1df95c6a-e488-4233-82a2-d0fc3041b9f2;IngestionEndpoint=https://australiaeast-0.in.applicationinsights.azure.com/;LiveEndpoint=https://australiaeast.livediagnostics.monitor.azure.com/"
          - "hidden-link: /app-insights-instrumentation-key" = "1df95c6a-e488-4233-82a2-d0fc3041b9f2"
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-address-checker/providers/microsoft.insights/components/appi-nbn-address-checker"
        } -> null
        # (10 unchanged attributes hidden)

      ~ auth_settings {
          ~ additional_login_parameters    = {} -> (known after apply)
          ~ allowed_external_redirect_urls = [] -> (known after apply)
          + default_provider               = (known after apply)
          ~ enabled                        = false -> (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          ~ token_refresh_extension_hours  = 0 -> (known after apply)
          ~ token_store_enabled            = false -> (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences          = (known after apply)
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
            }

          + facebook {
              + app_id                  = (known after apply)
              + app_secret              = (sensitive value)
              + app_secret_setting_name = (known after apply)
              + oauth_scopes            = (known after apply)
            }

          + github {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + google {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + microsoft {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + twitter {
              + consumer_key                 = (known after apply)
              + consumer_secret              = (sensitive value)
              + consumer_secret_setting_name = (known after apply)
            }
        }

      ~ site_config {
          ~ always_on                                     = false -> (known after apply)
          - api_definition_url                            = "" -> null
          - api_management_api_id                         = "" -> null
          - app_command_line                              = "" -> null
          ~ app_scale_limit                               = 200 -> (known after apply)
          ~ application_insights_connection_string        = (sensitive value)
          ~ application_insights_key                      = (sensitive value)
          - container_registry_managed_identity_client_id = "" -> null
          ~ default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled                = false -> (known after apply)
          ~ elastic_instance_minimum                      = 0 -> (known after apply)
          ~ health_check_eviction_time_in_min             = 0 -> (known after apply)
          - health_check_path                             = "" -> null
          ~ ip_restriction                                = [] -> (known after apply)
          ~ linux_fx_version                              = "Python|3.9" -> (known after apply)
          ~ pre_warmed_instance_count                     = 0 -> (known after apply)
          ~ remote_debugging_version                      = "" -> (known after apply)
          - runtime_scale_monitoring_enabled              = false -> null
          ~ scm_ip_restriction                            = [] -> (known after apply)
          ~ scm_type                                      = "None" -> (known after apply)
          ~ worker_count                                  = 1 -> (known after apply)
            # (12 unchanged attributes hidden)

          ~ application_stack {
              - use_custom_runtime          = false -> null
                # (2 unchanged attributes hidden)
            }
        }
    }

  # azurerm_resource_group.rg must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id       = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-address-checker" -> (known after apply)
      ~ name     = "rg-nbn-address-checker" -> "rg-nbn-location-checker" # forces replacement
      - tags     = {} -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.app must be replaced
-/+ resource "azurerm_service_plan" "app" {
      ~ id                           = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-address-checker/providers/Microsoft.Web/serverfarms/plan-nbn-address-checker" -> (known after apply)
      ~ kind                         = "functionapp" -> (known after apply)
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ name                         = "plan-nbn-address-checker" -> "plan-nbn-location-checker" # forces replacement
      ~ reserved                     = true -> (known after apply)
      ~ resource_group_name          = "rg-nbn-address-checker" -> "rg-nbn-location-checker" # forces replacement
      - tags                         = {} -> null
      ~ worker_count                 = 0 -> (known after apply)
      - zone_balancing_enabled       = false -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_storage_account.app must be replaced
-/+ resource "azurerm_storage_account" "app" {
      ~ access_tier                       = "Hot" -> (known after apply)
      ~ id                                = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-address-checker/providers/Microsoft.Storage/storageAccounts/stfuncnbnaddresschecker" -> (known after apply)
      + large_file_share_enabled          = (known after apply)
      ~ name                              = "stfuncnbnaddresschecker" -> "stfuncnbnlocationchecker" # forces replacement
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://stfuncnbnaddresschecker.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "stfuncnbnaddresschecker.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://stfuncnbnaddresschecker.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "stfuncnbnaddresschecker.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://stfuncnbnaddresschecker.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "stfuncnbnaddresschecker.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "australiaeast" -> (known after apply)
      ~ primary_queue_endpoint            = "https://stfuncnbnaddresschecker.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "stfuncnbnaddresschecker.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://stfuncnbnaddresschecker.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "stfuncnbnaddresschecker.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://stfuncnbnaddresschecker.z8.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "stfuncnbnaddresschecker.z8.web.core.windows.net" -> (known after apply)
      ~ resource_group_name               = "rg-nbn-address-checker" -> "rg-nbn-location-checker" # forces replacement
      ~ secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      - tags                              = {} -> null
        # (14 unchanged attributes hidden)

      ~ blob_properties {
          ~ change_feed_enabled      = false -> (known after apply)
          + default_service_version  = (known after apply)
          ~ last_access_time_enabled = false -> (known after apply)
          ~ versioning_enabled       = false -> (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      ~ network_rules {
          ~ bypass                     = [
              - "AzureServices",
            ] -> (known after apply)
          ~ default_action             = "Allow" -> (known after apply)
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      ~ queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ hour_metrics {
              ~ enabled               = true -> (known after apply)
              ~ include_apis          = true -> (known after apply)
              ~ retention_policy_days = 7 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }

          ~ logging {
              ~ delete                = false -> (known after apply)
              ~ read                  = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
              ~ write                 = false -> (known after apply)
            }

          ~ minute_metrics {
              ~ enabled               = false -> (known after apply)
              ~ include_apis          = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      ~ share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ retention_policy {
              ~ days = 7 -> (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # azurerm_storage_blob.app must be replaced
-/+ resource "azurerm_storage_blob" "app" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://stfuncnbnaddresschecker.blob.core.windows.net/content/fc6ddb5e89fd47088e0855e248e2596a1dd19134a0f9e168c08155070c0b4f94.zip" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "fc6ddb5e89fd47088e0855e248e2596a1dd19134a0f9e168c08155070c0b4f94.zip" -> "606ecd739f7b3cae789ea0a52e9cf2a9c8250fb0743304dba22094c2e9ba1756.zip" # forces replacement
      ~ storage_account_name   = "stfuncnbnaddresschecker" -> "stfuncnbnlocationchecker" # forces replacement
      ~ url                    = "https://stfuncnbnaddresschecker.blob.core.windows.net/content/fc6ddb5e89fd47088e0855e248e2596a1dd19134a0f9e168c08155070c0b4f94.zip" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_storage_container.app must be replaced
-/+ resource "azurerm_storage_container" "app" {
      ~ has_immutability_policy = false -> (known after apply)
      ~ has_legal_hold          = false -> (known after apply)
      ~ id                      = "https://stfuncnbnaddresschecker.blob.core.windows.net/content" -> (known after apply)
      ~ metadata                = {} -> (known after apply)
        name                    = "content"
      ~ resource_manager_id     = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-address-checker/providers/Microsoft.Storage/storageAccounts/stfuncnbnaddresschecker/blobServices/default/containers/content" -> (known after apply)
      ~ storage_account_name    = "stfuncnbnaddresschecker" -> "stfuncnbnlocationchecker" # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 7 to add, 0 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @scottmckenzie, Action: `pull_request`*